In [1]:
#Import dependencies
import pandas as pd

#Import modules
from sqlalchemy import create_engine

In [4]:
#Load CSV files
clean_inspection = "../Resources/clean_inspection_df2.csv"
clean_income = "../Resources/clean_income_df2.csv"

In [6]:

#View inspection dataframe
clean_inspection_df = pd.read_csv(clean_inspection)
clean_inspection_df.head()

,DBA,BOROUGH,STREET,ZIPCODE,CUISINE DESCRIPTION,SCORE,GRADE
0,TENGRITAGH UYGHUR CUSINE,Manhattan,WEST 37 STREET,10018.0,Chinese,13.0,A
1,KORILLA,Brooklyn,METROTECH CTR,11201.0,Korean,9.0,A
2,FANTASY BAR AND RESTAURANT,Bronx,EAST TREMONT AVENUE,10453.0,Spanish,11.0,A
3,INTERNATIONAL CATERERS,Bronx,AMPERE AVENUE,10465.0,American,11.0,A
4,FRESH CITY DELI,Bronx,HUNTS POINT AVENUE,10459.0,American,65.0,N

In [7]:
#Rename columns
clean_inspection_df.rename(columns = {'CUISINE DESCRIPTION':'CUISINE_DESCRIPTION'}, inplace = True)

In [8]:
#View income dataframe
clean_income_df = pd.read_csv(clean_income)
clean_income_df.head()

  INCOME LEVEL                              DBA            STREET
0  high income            MARIACHI'S RESTAURANT   CHAMBERS STREET
1  high income            SPOTIFY - BARISTA BAR  GREENWICH STREET
2  high income  STARBUCKS COFFEE COMPANY #29854  GREENWICH STREET
3  high income                          CANTEEN   WORLD TRADE CTR
4  high income     JOE & THE JUICE GREENWICH ST  GREENWICH STREET

In [9]:
#Rename columns
clean_income_df.rename(columns = {'INCOME LEVEL':'INCOME_LEVEL'}, inplace = True)

In [36]:
#Create database engine
"postgresql://[user]:[password]@[location]:[port]/[database]"

'postgresql://[user]:[password]@[location]:[port]/[database]'

In [37]:
#Import password from config.py file
from config import db_password

In [38]:
#Connection string for local server
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/NYC_restaurants"

In [39]:
#Create database engine
engine = create_engine(db_string)

In [40]:
#Import inspection data
clean_inspection_df.to_sql(name='inspection3', con=engine)

In [41]:
#Import income data
clean_income_df.to_sql(name='income3', con=engine)